In [2]:
import pandas as pd

In [3]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19]}

df = pd.DataFrame(data1)
df

     Name  Age
0     Tom   20
1  Joseph   21
2     Bob   19

In [4]:
df["Name"] ##列(縦)の取得

0       Tom
1    Joseph
2       Bob
Name: Name, dtype: object

In [5]:
df[["Name","Age"]] ##複数列の取得
# データ型はDataFrameになる

     Name  Age
0     Tom   20
1  Joseph   21
2     Bob   19

In [6]:
df.loc[0] ##行(横)の取得

Name    Tom
Age      20
Name: 0, dtype: object

In [7]:
df.loc[1:2,"Name":"Age"] ##複数行の取得
# df.loc[横の範囲(スライス),"縦の範囲(スライス)"]
## 片方がスライスでも大丈夫
# データ型はDataFrameになる

     Name  Age
1  Joseph   21
2     Bob   19

In [8]:
df.iloc[0:2,0:2] ##行と列の取得
# ilocは縦の範囲を番号で指定する
# 0から始まるので注意

     Name  Age
0     Tom   20
1  Joseph   21

In [9]:
df.at[0,"Name"] ##特定の要素の取得

'Tom'

In [10]:
df.iat[0,0] ##特定の要素の取得
# iatは縦の範囲を番号で指定する

'Tom'

In [11]:
df.info() ##データフレームの情報を取得

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [12]:
df[df["Age"] > 20] ##条件に合致するデータを取得

     Name  Age
1  Joseph   21

In [13]:
df["Age_in_days"] = df["Age"] * 365 ##新しい列を追加
df

     Name  Age  Age_in_days
0     Tom   20         7300
1  Joseph   21         7665
2     Bob   19         6935

In [14]:
df.at[0,"Age"] = 99 ##特定の要素を変更
df

     Name  Age  Age_in_days
0     Tom   99         7300
1  Joseph   21         7665
2     Bob   19         6935

In [15]:
df.iat[1,1] = 88 ##特定の要素を変更
# iatは縦の範囲を番号で指定する
df

     Name  Age  Age_in_days
0     Tom   99         7300
1  Joseph   88         7665
2     Bob   19         6935

In [16]:
df1 = pd.DataFrame([[0,1,2],[3,4,5]],columns = ['A','B','C'],index = ['a','b'])
df1  ##column = 横の名前を指定, index = 縦の名前を指定

   A  B  C
a  0  1  2
b  3  4  5

In [17]:
df1.columns = ["D","E","F"] 
df1.index = ["c","d"] 
df1  ##columns, indexは後から変更できる

   D  E  F
c  0  1  2
d  3  4  5

In [18]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19],'Category': ['A', 'B', 'A']}
df2 = pd.DataFrame(data1)
df2["Sales"] = [200,300,400]
df2["Gender"] = ["M","F","M"]
df2

     Name  Age Category  Sales Gender
0     Tom   20        A    200      M
1  Joseph   21        B    300      F
2     Bob   19        A    400      M

In [19]:
df2.sort_values(by="Sales") ##Salesを基準に昇順でソート

     Name  Age Category  Sales Gender
0     Tom   20        A    200      M
1  Joseph   21        B    300      F
2     Bob   19        A    400      M

In [20]:
df2.sort_values(by="Sales",ascending=False) ##Salesを基準に降順でソート

     Name  Age Category  Sales Gender
2     Bob   19        A    400      M
1  Joseph   21        B    300      F
0     Tom   20        A    200      M